программа запущена
-----------------------------
1 - низкий
2 - ниже нормального
3 - нормальный
4 - выше нормального
5 - высокий
6 - максимальный
-----------------------------
команды:
  номер_потока приоритет
  7 - запустить нагрузчик
  8 - выход
-----------------------------
поток инкремент | ID: 17512 | итераций: 483342757 | приоритет: низкий
поток фибоначчи | ID: 16344 | итераций: 9400957 | приоритет: нормальный
поток факториал | ID: 16564 | итераций: 25008652 | приоритет: высокий
-----------------------------
поток инкремент | ID: 17512 | итераций: 998672593 | приоритет: низкий
поток фибоначчи | ID: 16344 | итераций: 19175467 | приоритет: нормальный
поток факториал | ID: 16564 | итераций: 45244605 | приоритет: высокий
-----------------------------
поток инкремент | ID: 17512 | итераций: 1506506331 | приоритет: низкий
поток фибоначчи | ID: 16344 | итераций: 29371358 | приоритет: нормальный
поток факториал | ID: 16564 | итераций: 69582471 | приоритет: высокий
-----------------------------
поток инкремент | ID: 17512 | итераций: 2019980986 | приоритет: низкий
поток фибоначчи | ID: 16344 | итераций: 39823887 | приоритет: нормальный
поток факториал | ID: 16564 | итераций: 94349363 | приоритет: высокий
-----------------------------
поток инкремент | ID: 17512 | итераций: 2556252213 | приоритет: низкий
поток фибоначчи | ID: 16344 | итераций: 50232742 | приоритет: нормальный
поток факториал | ID: 16564 | итераций: 115587109 | приоритет: высокий
-----------------------------
поток инкремент | ID: 17512 | итераций: 3104894602 | приоритет: низкий
поток фибоначчи | ID: 16344 | итераций: 60714138 | приоритет: нормальный
поток факториал | ID: 16564 | итераций: 139119491 | приоритет: высокий
-----------------------------
7
нагрузчик запущен с приоритетом максимальный
поток инкремент | ID: 17512 | итераций: 3608330889 | приоритет: низкий
поток фибоначчи | ID: 16344 | итераций: 70986169 | приоритет: нормальный
поток факториал | ID: 16564 | итераций: 169422569 | приоритет: высокий
-----------------------------
поток инкремент | ID: 17512 | итераций: 3993158705 | приоритет: низкий
поток фибоначчи | ID: 16344 | итераций: 81176109 | приоритет: нормальный
поток факториал | ID: 16564 | итераций: 189685664 | приоритет: высокий
-----------------------------
поток инкремент | ID: 17512 | итераций: 4380077647 | приоритет: низкий
поток фибоначчи | ID: 16344 | итераций: 91587319 | приоритет: нормальный
поток факториал | ID: 16564 | итераций: 213735425 | приоритет: высокий
-----------------------------
поток инкремент | ID: 17512 | итераций: 4783444524 | приоритет: низкий
поток фибоначчи | ID: 16344 | итераций: 100690648 | приоритет: нормальный
поток факториал | ID: 16564 | итераций: 238382395 | приоритет: высокий
-----------------------------
поток инкремент | ID: 17512 | итераций: 5150827193 | приоритет: низкий
поток фибоначчи | ID: 16344 | итераций: 110004927 | приоритет: нормальный
поток факториал | ID: 16564 | итераций: 261590399 | приоритет: высокий
-----------------------------
поток инкремент | ID: 17512 | итераций: 5532047890 | приоритет: низкий
поток фибоначчи | ID: 16344 | итераций: 120234685 | приоритет: нормальный
поток факториал | ID: 16564 | итераций: 285388186 | приоритет: высокий
-----------------------------
поток инкремент | ID: 17512 | итераций: 29919333032 | приоритет: низкий
поток фибоначчи | ID: 16344 | итераций: 634764210 | приоритет: нормальный
поток факториал | ID: 16564 | итераций: 1585666677 | приоритет: высокий
-----------------------------
нагрузчик завершил работу, приоритет нормальный
поток инкремент | ID: 17512 | итераций: 30420046014 | приоритет: низкий
поток фибоначчи | ID: 16344 | итераций: 645214912 | приоритет: нормальный
поток факториал | ID: 16564 | итераций: 1610968934 | приоритет: высокий
-----------------------------
поток инкремент | ID: 17512 | итераций: 30970552153 | приоритет: низкий
поток фибоначчи | ID: 16344 | итераций: 655366089 | приоритет: нормальный
поток факториал | ID: 16564 | итераций: 1642674594 | приоритет: высокий
-----------------------------
поток инкремент | ID: 17512 | итераций: 31480721803 | приоритет: низкий
поток фибоначчи | ID: 16344 | итераций: 665619953 | приоритет: нормальный
поток факториал | ID: 16564 | итераций: 1672748975 | приоритет: высокий
-----------------------------
поток инкремент | ID: 17512 | итераций: 32012488492 | приоритет: низкий
поток фибоначчи | ID: 16344 | итераций: 676332144 | приоритет: нормальный
поток факториал | ID: 16564 | итераций: 1698820629 | приоритет: высокий
-----------------------------
поток инкремент | ID: 17512 | итераций: 32462831996 | приоритет: низкий
поток фибоначчи | ID: 16344 | итераций: 687913430 | приоритет: нормальный
поток факториал | ID: 16564 | итераций: 1726521892 | приоритет: высокий
-----------------------------
поток инкремент | ID: 17512 | итераций: 81290079871 | приоритет: низкий
поток фибоначчи | ID: 16344 | итераций: 1660724808 | приоритет: нормальный
поток факториал | ID: 16564 | итераций: 4165442338 | приоритет: высокий
-----------------------------
поток инкремент | ID: 17512 | итераций: 81838894455 | приоритет: низкий
поток фибоначчи | ID: 16344 | итераций: 1670711778 | приоритет: нормальный
поток факториал | ID: 16564 | итераций: 4197957455 | приоритет: высокий
-----------------------------
поток инкремент | ID: 17512 | итераций: 82354370398 | приоритет: низкий
поток фибоначчи | ID: 16344 | итераций: 1681480762 | приоритет: нормальный
поток факториал | ID: 16564 | итераций: 4226422508 | приоритет: высокий
-----------------------------
8
программа завершена

C:\Users\st310-07\Documents\Shengals\pract10_system\x64\Debug\pract10_system.exe (процесс 2632) завершил работу с кодом 0 (0x0).
Чтобы автоматически закрывать консоль при остановке отладки, включите параметр "Сервис" ->"Параметры" ->"Отладка" -> "Автоматически закрыть консоль при остановке отладки".
Нажмите любую клавишу, чтобы закрыть это окно:
